{
    "experience": [{
            "title": "Internal Workflow Engine",
            "description": "As the Solution Architect and Lead Developer, I designed and architected Simplifi, a mission-critical enterprise platform that automated master data workflows, GRC controls, and compliance reporting. The core value was enabling complex, real-time integration with major enterprise systems, including SAP for business partner management and Pathlock for automated user access provisioning and audit readiness. This full-stack solution featured modular capabilities like ICFR dashboards and Delegation of Authority (DOA), ensuring a secure and streamlined internal control environment.",
            "sections": [{
                    "title": "Application Structure",
                    "color": "text-blue-400",
                    "items": [
                        "Laravel, MSSQL Server, HanaDB",
                        "Livewire, Javascript & TailwindCSS",
                        "Azure, Ubntu, Nginx, Azure WAF, SSO"
                    ]
                },
                {
                    "title": "Integrations",
                    "color": "text-purple-400",
                    "items": [
                        "SAP: Business Partner workflows",
                        "Salesforce: Customer onboarding",
                        "Pathlock: Access provisioning & GRC",
                        "SAP: Automating PR,PO & SO workflows"
                    ]
                }
            ],
            "achievementsTitle": "Key Achievements",
            "achievements": [
                "Automated 90% of Business Partner workflows",
                "Implemented DOA module for group-wide policy and transaction governance",
                "Resolved SAP approval bottlenecks across multi-layered workflows"

            ],
            "architectureTitle": "Workflow Application Architecture",
            "architectureSvg": "SimplifiArchitecture",
            "showArchitecture": true
        },
        {
            "title": "RunRun Ecommerce (Wayno)",
            "description": "I served as the Technical Lead, overseeing the architecture and full-stack development of this high-performance, multi-vendor marketplace platform. The key challenge involved architecting a scalable platform capable of supporting multiple simultaneous vendors while managing real-time logistics and delivery. I designed and integrated complex APIs, successfully achieving integration with the Abu Dhabi Police app for compliant courier deliveries. This solution featured comprehensive shop/product management APIs and integrated courier/rider tracking systems for continuous logistics monitoring.",
            "sections": [{
                    "title": "Features",
                    "color": "text-blue-400",
                    "items": [
                        "Ecommerce Web & Mobile app",
                        "Courier App & Agents app",
                        "Live rider tracking using Google APIs"
                    ]
                },
                {
                    "title": "Integrations",
                    "color": "text-purple-400",
                    "items": [
                        "AD Police App with Courier module",
                        "Own Delivery app & Ecommerce App"
                    ]
                }, {
                    "title": "Technical Stack",
                    "color": "text-purple-400",
                    "items": [
                        "PHP, Laravel, React Native, SQL, REDIS",
                        "AWS EC2, RDS, S3",
                        "Google Map, Firebase"
                    ]
                }
            ],
            "achievementsTitle": "Key Responsibilities",
            "achievements": [
                "Team Leadership: Led a cross-functional team of backend and frontend developers, ensuring smooth collaboration and timely delivery across sprints",
                "Requirement Gathering: Spearheaded the initial and ongoing requirements analysis, translating business needs into technical specifications.",
                "Testing Coordination: Worked closely with QA testers to define test cases, manage bug tracking, and ensure product quality across releases.",
                "Stakeholder Engagement: Conducted meetings with third-party stakeholders, including government entities, to align on compliance, integrations, and operational workflows."
            ],
            "architectureTitle": "System Architecture",
            "architectureSvg": "RunRunArchitecture",
            "showArchitecture": true
        }, {
            "title": "Ducon Outdoor Living (duconodl.com)",
            "description": "I led the full-stack architecture and end-to-end delivery of high-visibility commercial websites. This particular project was initially built on PHP/Yii2 while others where built on Concrete5 and Wordpress. The scope included a successful architectural rebuild and migration to Laravel, featuring a complex Salesforce API integration for core backend services. My ownership covered secure architecture, cloud deployment, and the highly responsive product interface.",
            "sections": [{
                    "title": "Features",
                    "color": "text-blue-400",
                    "items": [
                        "Ecommerce Web app",
                        "Centralized Product Catalog",
                        "Showroom Virtual Tour"
                    ]
                },
                {
                    "title": "Integrations",
                    "color": "text-purple-400",
                    "items": [
                        "Salesforce API integration for product catalog",
                        "Matterport 3D model integration for showroom virtual tour"
                    ]
                }, {
                    "title": "Technical Stack",
                    "color": "text-purple-400",
                    "items": [
                        "PHP, Laravel, Yii2, MySQL",
                        "React, JQuery, Bootstrap, Google Tag Manager",
                        "REST API, Salesforce API"
                    ]
                }
            ],
            "achievementsTitle": "Key Responsibilities",
            "achievements": [
                "Led Development Teams: Oversaw and guided a team of developers to ensure timely delivery of high-quality e-commerce solutions.",
                "Application Monitoring & Optimization: Monitored all company e-commerce applications, ensuring performance, security, and scalability.",
                "Cross-Functional Collaboration: Worked closely with the digital marketing team to enhance SEO strategies and optimize campaigns for improved visibility and conversions.",
                "System Integrations: Successfully integrated multiple third-party systems and services to streamline operations and improve user experience.",
                "Website Revamp: Spearheaded major website redesigns and enhancements, resulting in improved UI/UX and increased engagement."
            ],
            "architectureTitle": "System Architecture",
            "architectureSvg": "",
            "showArchitecture": false
        }
    ],
    "skills": [{
            "name": "Laravel",
            "level": "Expert",
            "description": "Proficient in Laravel & Laravel tools for building scalable web applications."
        },
        {
            "name": "PHP",
            "level": "Expert",
            "description": "Understand the core concepts of PHP and how to use it to build scalable web applications."
        },
        {
            "name": "Javascript",
            "level": "Expert",
            "description": "Proficient in Javascript and how to use it to build modern web applications."
        },
        {
            "name": "React",
            "level": "Intermediate",
            "description": "Proficient in React, Redux, and React Router for building scalable web applications."
        },
        {
            "name": "Python",
            "level": "Intermediate",
            "description": "Intermediate knowledge."
        },
        {
            "name": "Django",
            "level": "Intermediate",
            "description": "Intermediate knowledge."
        },
        {
            "name": "FastAPI",
            "level": "Intermediate",
            "description": "Intermediate knowledge."
        },
        {
            "name": "API",
            "level": "Expert",
            "description": "Proficient in REST APIs, implemented numerous integrations with third party services."
        },
        {
            "name": "SQL",
            "level": "Expert",
            "description": "Proficient in SQL, worked with MySQL, PostgreSQL, MSSQL and HanaDB."
        },
        {
            "name": "AWS",
            "level": "Intermediate",
            "description": "EC2, S3,RDS, Lightsail."
        },
        {
            "name": "Linux",
            "level": "Intermediate",
            "description": "Devops, CI/CD, Docker, Github Actions."
        }
    ],
    "projects": [{
        "name": "Workflow Engine",
        "description": "Description of Project 1",
        "technologies": ["Technology 1", "Technology 2", "Technology 3"],
        "link": "https://github.com/username/project1"
    }]
}